#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/knanao/dev/runs/run-7ZuSDDFLqvVSU6vg

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
data.vault_generic_secret.terraform: Reading...
vault_gcp_secret_backend.gcp: Refreshing state... [id=gcp]
vault_gcp_secret_roleset.terraform: Refreshing state... [id=gcp/roleset/terraform]
data.vault_generic_secret.terraform: Read complete after 1s [id=gcp/key/terraform]
data.external.credentials: Reading...
data.external.credentials: Read complete after 5s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.test will be created
  + resource "google_storage_bucket" "test" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "knanao-test"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "VAULT_ADDR" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-7ZuSDDFLqvVSU6vg/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pushed by: @knanao, Action: `pull_request`*